Importing Libraries

In [20]:
import pandas as pd
import sqlite3

Loading Data into Pandas Dataframe

In [2]:
Customers= pd.read_csv("Data/CSV/Customers.csv", encoding="latin1", sep=";")
Location= pd.read_csv("Data/CSV/Location.csv", encoding="latin1", sep=";")
Orders= pd.read_csv("Data/CSV/Orders.csv", encoding="latin1", sep=";")
Products= pd.read_csv("Data/CSV/Products.csv", encoding="latin1", sep=";")

Pushing Dataframes Into SQL Sales Database

In [21]:
conn = sqlite3.connect("Data/SQL_db/sales.db")

Customers.to_sql("customers", conn, if_exists="replace", index=False)
Location.to_sql("Location", conn, if_exists="replace", index=False)
Orders.to_sql("Orders", conn, if_exists="replace", index=False)
Products.to_sql("Products", conn, if_exists="replace", index=False)

1894

Exploring customers Table

In [22]:
# selecting All the data from customers Table
query="""
SELECT * 
FROM
customers
"""
df = pd.read_sql_query(query, conn)
df

    Customer ID       Customer Name
0      AA-10315          Alex Avila
1      AA-10375        Allen Armold
2      AA-10480        Andrew Allen
3      AA-10645       Anna Andreadi
4      AB-10015       Aaron Bergman
..          ...                 ...
788    XP-21865        Xylona Preis
789    YC-21895      Yoseph Carroll
790    YS-21880       Yana Sorensen
791    ZC-21910    Zuschuss Carroll
792    ZD-21925  Zuschuss Donatelli

[793 rows x 2 columns]

In [15]:
# selecting only 10 customers

query="""
select *
from customers
limit 10;
"""

# limit used for getting the desired Number of results from a query


df = pd.read_sql_query(query, conn)
df

  Customer ID         Customer Name
0    AA-10315            Alex Avila
1    AA-10375          Allen Armold
2    AA-10480          Andrew Allen
3    AA-10645         Anna Andreadi
4    AB-10015         Aaron Bergman
5    AB-10060       Adam Bellavance
6    AB-10105         Adrian Barton
7    AB-10150           Aimee Bixby
8    AB-10165           Alan Barnes
9    AB-10255  Alejandro Ballentine

In [23]:
# selecting Only one Attribute from a table

query="""
select [Customer Name]
from customers
"""

df=pd.read_sql_query(query,conn)
df

          Customer Name
0            Alex Avila
1          Allen Armold
2          Andrew Allen
3         Anna Andreadi
4         Aaron Bergman
..                  ...
788        Xylona Preis
789      Yoseph Carroll
790       Yana Sorensen
791    Zuschuss Carroll
792  Zuschuss Donatelli

[793 rows x 1 columns]

In [19]:
# selecting Only one Attribute from a table

query="""
select [Customer Name]
from customers
order by [Customer Name]
desc
"""

df=pd.read_sql_query(query,conn)
df

          Customer Name
0    Zuschuss Donatelli
1      Zuschuss Carroll
2        Yoseph Carroll
3         Yana Sorensen
4          Xylona Preis
..                  ...
788           Adam Hart
789     Adam Bellavance
790      Aaron Smayling
791       Aaron Hawkins
792       Aaron Bergman

[793 rows x 1 columns]

In [5]:
query="""SELECT c.[Customer Name],
sum(o.Quantity*O.Sales) as Total_Sales
from orders o
join customers c
on o.[Customer ID] = c.[Customer ID]
group by c.[Customer Name]
order by Total_Sales
desc
limit 10;
"""
df = pd.read_sql_query(query, conn)
df

     Customer Name  Total_Sales
0      Sean Miller       146726
1    Adrian Barton       143812
2     Tamara Chand        92582
3     Becky Martin        88132
4      Joseph Holt        80478
5     Ken Lonsdale        74843
6        Greg Tran        72957
7     Bill Shonely        71566
8    Maria Etezadi        71540
9  Patrick O'Brill        69243

In [6]:
query="""SELECT * from orders
"""
df = pd.read_sql_query(query, conn)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Row ID       9994 non-null   int64
 1   Order ID     9994 non-null   object
 2   Order Date   9994 non-null   object
 3   Ship Date    9994 non-null   object
 4   Ship Mode    9994 non-null   object
 5   Customer ID  9994 non-null   object
 6   Segment      9994 non-null   object
 7   Postal Code  9994 non-null   int64
 8   Product ID   9994 non-null   object
 9   Sales        9994 non-null   object
 10  Quantity     9994 non-null   int64
 11  Discount     9994 non-null   object
 12  Profit       9994 non-null   object
dtypes: int64(3), object(10)
memory usage: 1015.1+ KB

In [16]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Segment', 'Postal Code', 'Product ID', 'Sales',
       'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [18]:
df.columns.tolist()

['Row ID',
 'Order ID',
 'Order Date',
 'Ship Date',
 'Ship Mode',
 'Customer ID',
 'Segment',
 'Postal Code',
 'Product ID',
 'Sales',
 'Quantity',
 'Discount',
 'Profit']

In [20]:
Customers.columns.tolist()

['Customer ID', 'Customer Name']

In [22]:
Location.columns.tolist()

['Postal Code', 'City', 'State', 'Region', 'Country/Region']

In [24]:
Orders.columns.tolist()

['Row ID',
 'Order ID',
 'Order Date',
 'Ship Date',
 'Ship Mode',
 'Customer ID',
 'Segment',
 'Postal Code',
 'Product ID',
 'Sales',
 'Quantity',
 'Discount',
 'Profit']

In [26]:
Products.columns.to_list()

['Product ID', 'Category', 'Sub-Category', 'Product Name']

In [ ]:
['Product ID','Product Name', 'Category', 'Sub-Category' ]